# Eleman İşlemleri

In [2]:
import pandas as pd
import numpy as np
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [3]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}

In [4]:
sozluk

{'var1': array([2, 9, 1, 5, 3]),
 'var2': array([5, 2, 3, 8, 2]),
 'var3': array([6, 1, 9, 9, 0])}

In [5]:
df = pd.DataFrame(sozluk)

In [6]:
df

   var1  var2  var3
0     2     5     6
1     9     2     1
2     1     3     9
3     5     8     9
4     3     2     0

In [7]:
df[0:1]

   var1  var2  var3
0     2     5     6

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.index = ["a","b","c","d","e"]

In [11]:
df

   var1  var2  var3
a     2     5     6
b     9     2     1
c     1     3     9
d     5     8     9
e     3     2     0

In [12]:
df["c":"e"]

   var1  var2  var3
c     1     3     9
d     5     8     9
e     3     2     0

In [13]:
#silme

In [14]:
df.drop("a",axis=0)

   var1  var2  var3
b     9     2     1
c     1     3     9
d     5     8     9
e     3     2     0

In [15]:
df

   var1  var2  var3
a     2     5     6
b     9     2     1
c     1     3     9
d     5     8     9
e     3     2     0

In [16]:
df = df.drop("a",axis=0)

In [17]:
df

   var1  var2  var3
b     9     2     1
c     1     3     9
d     5     8     9
e     3     2     0

In [19]:
df.drop("b",axis=0, inplace= True)

In [20]:
df

   var1  var2  var3
c     1     3     9
d     5     8     9
e     3     2     0

In [21]:
#fancy

In [22]:
l = ["c","e"]

In [23]:
df.drop(l,axis=0)

   var1  var2  var3
d     5     8     9

In [24]:
#degiskenler icin

In [25]:
"var1" in df

True

In [26]:
l = ["var1","var4","var2"]

In [27]:
for i in l:
    print(i in df)

True
False
True

In [28]:
df["var4"] = df["var1"] / df["var2"]

In [29]:
df

   var1  var2  var3      var4
c     1     3     9  0.333333
d     5     8     9  0.625000
e     3     2     0  1.500000

In [30]:
#degisken silmek

In [32]:
df.drop("var4", axis = 1, inplace = True)

In [33]:
df

   var1  var2  var3
c     1     3     9
d     5     8     9
e     3     2     0

In [36]:
l = ["var1","var2"]

In [37]:
df.drop(l,axis = 1)

   var3
c     9
d     9
e     0